10/data/attachments/3448aef10b1fce34.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_f88cbd7e-7760-4471-ab6e-83dbb5fb2da5</nif:username>
            <nif:friendToBeAdded>Jennifer_figure_Friend_69131_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>